In [7]:
!pip install psycopg2 sqlalchemy pandas

Requirement already satisfied: psycopg2 in c:\python\python310\lib\site-packages (2.9.5)
Collecting sqlalchemy
  Downloading SQLAlchemy-1.4.42-cp310-cp310-win_amd64.whl (1.6 MB)
     ---------------------------------------- 1.6/1.6 MB 4.2 MB/s eta 0:00:00
Requirement already satisfied: pandas in c:\python\python310\lib\site-packages (1.5.1)
Collecting greenlet!=0.4.17
  Downloading greenlet-1.1.3.post0-cp310-cp310-win_amd64.whl (101 kB)
     -------------------------------------- 101.9/101.9 kB 3.0 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.21.0 in c:\python\python310\lib\site-packages (from pandas) (1.23.4)
Requirement already satisfied: pytz>=2020.1 in c:\python\python310\lib\site-packages (from pandas) (2022.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\python\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\python\python310\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-1.1.3.post0 sqlalchemy-1.4.42

In [231]:
import psycopg2
import pandas as pd
from sqlalchemy import create_engine

In [232]:
def create_database():
    conn = psycopg2.connect('dbname=postgres user=postgres password=admin')
    conn.set_session(autocommit=True)
    cursor = conn.cursor()
    
    cursor.execute('DROP DATABASE IF EXISTS world_cup')
    cursor.execute('CREATE DATABASE world_cup')
    
    conn = psycopg2.connect('host=127.0.0.1 dbname=world_cup user=postgres password=admin')
    cursor = conn.cursor()
    
    return cursor, conn

In [233]:
def drop_tables(cursor, conn):
    for query in drop_table_queries:
        cursor.execute(query)
        conn.commit()

In [234]:
def create_tables(cursor, conn):
    for query in create_table_queries:
        cursor.execute(query)
        conn.commit()

In [235]:
st1 = pd.read_excel('C:/Users/Administrador/Python_postgres/team_st1.xlsx',index_col=[0])

In [236]:
st1.head()

  Country_code  Win  Draw  Loss
0          GER    6     1     0
1          ARG    5     1     1
2          NET    5     2     0
3          BRA    3     2     2
4          COL    4     0     1

In [237]:
st2 = pd.read_excel('C:/Users/Administrador/Python_postgres/team_st2.xlsx',index_col=[0])

In [238]:
st2.head()

          Team Country_code  Position  Points
0      Germany          GER         1      19
1    Argentina          ARG         2      16
2  Netherlands          NET         3      17
3       Brazil          BRA         4      11
4     Colombia          COL         5      12

In [239]:
st3 = pd.read_excel('C:/Users/Administrador/Python_postgres/team_st3.xlsx',index_col=[0])

In [240]:
st3.head()

          Team  Goals For  Goals Against  Goal Difference
0      Germany         18              4               14
1    Argentina          8              4                4
2  Netherlands         15              4               11
3       Brazil         11             14               -3
4     Colombia         12              4                8

In [241]:
cursor, conn = create_database()

In [242]:
st1_create_table = ("""CREATE TABLE IF NOT EXISTS st1(
country_code VARCHAR PRIMARY KEY,
win numeric,
draw numeric,
loss numeric
)""")

In [243]:
cursor.execute(st1_create_table)
conn.commit()

In [244]:
st2_create_table = ("""CREATE TABLE IF NOT EXISTS st2(
country_code VARCHAR,
team VARCHAR,
position numeric,
points numeric
)""")

In [245]:
cursor.execute(st2_create_table)
conn.commit()

In [246]:
st3_create_table = ("""CREATE TABLE IF NOT EXISTS st3(
team VARCHAR,
goals_for numeric,
goals_against numeric,
goal_difference numeric
)""")

In [247]:
cursor.execute(st3_create_table)
conn.commit()

In [248]:
st1_insert_table = ("""INSERT INTO st1(
Country_code,
Win,
Draw,
Loss)
VALUES (%s, %s, %s, %s)
""")

In [249]:
for i, row in st1.iterrows():
    cursor.execute(st1_insert_table, list(row))

In [250]:
conn.commit()

In [251]:
st2_insert_table = ("""INSERT INTO st2(
team,
country_code,
position ,
points )
VALUES (%s, %s, %s, %s)
""")

In [252]:
for i, row in st2.iterrows():
    cursor.execute(st2_insert_table, list(row))

In [253]:
conn.commit()

In [254]:
st3_insert_table = ("""INSERT INTO st3(
team ,
goals_for ,
goals_against ,
goal_difference)
VALUES (%s, %s, %s, %s)
""")

In [255]:
for i, row in st3.iterrows():
    cursor.execute(st3_insert_table, list(row))

In [256]:
conn.commit()